NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
static uint32_t segment_count_from_start_packet(dfu_packet_t* p_packet)
{
    uint32_t start_address = p_packet->payload.start.start_address;
    if (start_address == 0xFFFFFFFF)
    {
        start_address = 0; /* It'll be aligned. */
    }
    uint32_t segment_count = ((p_packet->payload.start.length * 4) + (start_address & 0x0F) - 1) / 16 + 1;

    if (p_packet->payload.start.signature_length != 0)
    {
        segment_count += p_packet->payload.start.signature_length / SEGMENT_LENGTH;
    }
    if (segment_count > 0xFFFF)
    {
        /* can't have more than 65536 segments in a transmission */
        segment_count = 0xFFFF;
    }

    return segment_count;
}

#define SET_STATE(s) set_state(s, __LINE__)
static void set_state(dfu_state_t state, uint16_t line)
{
    m_state = state;
    __LOG(RTT_CTRL_TEXT_GREEN "NEW STATE: %s (L%u)\n", m_state_strs[(uint32_t) state], line);
}

static beacon_type_t state_beacon_type(dfu_type_t transfer_type)
{
    switch (transfer_type)
    {
        case DFU_TYPE_APP:
            return BEACON_TYPE_READY_APP;
        case DFU_TYPE_BOOTLOADER:
            return BEACON_TYPE_READY_BL;
        case DFU_TYPE_SD:
            return BEACON_TYPE_READY_SD;
        default:
            return BEACON_TYPE_FWID;
    }
}

static void send_progress_event(uint16_t segment, uint16_t total_segments)
{
    bl_evt_t segment_rx;
    segment_rx.type = BL_EVT_TYPE_DFU_DATA_SEGMENT_RX;
    segment_rx.params.dfu.data_segment.received_segment = segment;
    segment_rx.params.dfu.data_segment.total_segments = total_segments;
    bootloader_evt_send(&segment_rx);
}

static uint32_t packet_tx_dynamic(dfu_packet_t* p_packet,
    uint32_t length,
    bl_radio_interval_type_t interval_type,
    uint8_t repeats)
{
    static uint8_t tx_slot = 1;
    if (tx_slot >= m_tx_slots || tx_slot == 0)
    {
        tx_slot = 1;
    }
    bl_evt_t tx_evt;
    tx_evt.type = BL_EVT_TYPE_TX_RADIO;
    tx_evt.params.tx.radio.p_dfu_packet = p_packet;
    tx_evt.params.tx.radio.length = length;
    tx_evt.params.tx.radio.interval_type = interval_type;
    tx_evt.params.tx.radio.tx_count = repeats;
    tx_evt.params.tx.radio.tx_slot = tx_slot;
    uint32_t status = bootloader_evt_send(&tx_evt);
    if (status == NRF_SUCCESS)
    {
        tx_slot++;
    }
    return status;
}

static bool signature_check(void)
{
    __LOG("Verifying signature... ");
    /* if we don't have a public key we will accept all firmware upgrades. */
    if (m_bl_info_pointers.p_ecdsa_public_key == NULL)
    {
        __LOG("No key (THAT'S OKAY THOUGH)\n");
        return true;
    }

    /* if we have a key, but the transfer isn't signed, we will fail */
    if (m_transaction.signature_length == 0)
    {
        __LOG("No signature (FAILURE)\n");
        return false;
    }

    uint8_t hash[uECC_BYTES];
    sha256_context_t hash_context;
    sha256_init(&hash_context);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.type, 1);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.p_indicated_start_addr, 4);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.length, 4);
    uint8_t padding = 0;
    sha256_update(&hash_context, &padding, 1);

    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_APP);
            break;
        case DFU_TYPE_SD:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_SD);
            break;
        case DFU_TYPE_BOOTLOADER:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_BL);
            break;
        default:
            break;
    }

    dfu_transfer_sha256(&hash_context);
#if NORDIC_SDK_VERSION >= 11
    sha256_final(&hash_context, hash, false);
#else
    sha256_final(&hash_context, hash);
#endif
    bool success = (bool) (uECC_verify(m_bl_info_pointers.p_ecdsa_public_key, hash, m_transaction.signature));

    if (success)
    {
        __LOG("OK\n");
    }
    else
    {
        __LOG("FAIL\n");
    }
    return success;
}

static void beacon_set(beacon_type_t type)
{
    dfu_packet_t dfu_packet;
    memset(&dfu_packet, 0, sizeof(dfu_packet_t));

    uint8_t repeats = TX_REPEATS_FWID;
    bl_radio_interval_type_t interval_type = TX_INTERVAL_TYPE_FWID;
    uint8_t length = 0;

    if (type >= BEACON_TYPE_READY_APP &&
        type <= BEACON_TYPE_READY_BL)
    {
        dfu_packet.packet_type = DFU_PACKET_TYPE_STATE;
        dfu_packet.payload.state.authority = m_transaction.authority;
        dfu_packet.payload.state.flood = m_transaction.flood;
        dfu_packet.payload.state.transaction_id = m_transaction.transaction_id;
        dfu_packet.payload.state.relay_node = (m_state == DFU_STATE_RELAY_CANDIDATE);
        dfu_packet.payload.state.fwid = m_transaction.target_fwid_union;
        repeats = TX_REPEATS_READY;
        if (m_transaction.authority == 0)
        {
            interval_type = TX_INTERVAL_TYPE_DFU_REQ;
        }
        else
        {
            interval_type = TX_INTERVAL_TYPE_READY;
        }
    }

    switch (type)
    {
        case BEACON_TYPE_FWID:
            length = DFU_PACKET_LEN_FWID;
            dfu_packet.packet_type = DFU_PACKET_TYPE_FWID;
            dfu_packet.payload.fwid = *m_bl_info_pointers.p_fwid;
            break;

        case BEACON_TYPE_READY_APP:
            length = DFU_PACKET_LEN_STATE_APP;
            dfu_packet.payload.state.dfu_type = DFU_TYPE_APP;
            break;

        case BEACON_TYPE_READY_SD:
            length = DFU_PACKET_LEN_STATE_SD;
            dfu_packet.payload.state.dfu_type = DFU_TYPE_SD;
            break;

        case BEACON_TYPE_READY_BL:
            length = DFU_PACKET_LEN_STATE_BL;
            dfu_packet.payload.state.dfu_type = DFU_TYPE_BOOTLOADER;
            break;
    }

    bl_evt_t tx_evt;
    tx_evt.type = BL_EVT_TYPE_TX_RADIO;
    tx_evt.params.tx.radio.p_dfu_packet = &dfu_packet;
    tx_evt.params.tx.radio.length = length;
    tx_evt.params.tx.radio.interval_type = interval_type;
    tx_evt.params.tx.radio.tx_count = repeats;
    tx_evt.params.tx.radio.tx_slot = TX_SLOT_BEACON;

