NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
            __LOG("Signature packet #%u\n", index);
            m_transaction.signature_bitmap |= (1 << index);
            error_code = NRF_SUCCESS;
        }
    }

    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }
    send_progress_event(p_packet->payload.data.segment, m_transaction.segment_count);
    m_transaction.segments_remaining--;
    *p_do_relay = true;
    if (m_data_req_segment == DATA_REQ_SEGMENT_NONE)
    {
        request_missing_data(p_packet->payload.data.segment);
    }
    return error_code;
}

static uint32_t handle_data_packet(dfu_packet_t* p_packet, uint16_t length)
{
    if (p_packet->payload.data.transaction_id != m_transaction.transaction_id)
    {
        return NRF_ERROR_INVALID_DATA;
    }
    if (packet_in_cache(p_packet))
    {
        return NRF_SUCCESS;
    }

    uint32_t status;
    bool do_relay = false;

    switch (m_state)
    {
        case DFU_STATE_READY:
            if (p_packet->payload.start.segment == 0)
            {
                target_rx_start(p_packet, &do_relay);
                status = NRF_SUCCESS;
            }
            else
            {
                __LOG("ERROR: Received non-0 segment.\n");
                tid_cache_entry_put(m_transaction.transaction_id);
                start_req(m_transaction.type, &m_transaction.target_fwid_union); /* go back to req, we've missed packet 0 */
                status = NRF_ERROR_INVALID_STATE;
            }
            break;

        case DFU_STATE_TARGET:
            if (p_packet->payload.data.segment > 0 &&
                p_packet->payload.data.segment <= m_transaction.segment_count)
            {
                target_rx_data(p_packet, length, &do_relay);
                status = NRF_SUCCESS;
            }
            else
            {
                status = NRF_ERROR_INVALID_DATA;
            }

            /* ending the DFU */
            if (m_transaction.segments_remaining == 0)
            {
                start_rampdown();
            }
            break;

        case DFU_STATE_RELAY_CANDIDATE:
        {
            if (p_packet->payload.data.segment == 0)
            {
                m_transaction.segment_count = segment_count_from_start_packet(p_packet);
            }
            SET_STATE(DFU_STATE_RELAY);
            tx_abort(TX_SLOT_BEACON);
            bl_evt_t relay_evt;
            relay_evt.type = BL_EVT_TYPE_DFU_START;
            relay_evt.params.dfu.start.role = DFU_ROLE_RELAY;
            relay_evt.params.dfu.start.fwid = m_transaction.target_fwid_union;
            relay_evt.params.dfu.start.dfu_type = m_transaction.type;
            status = bootloader_evt_send(&relay_evt);

            do_relay = true;
            break;
        }
        case DFU_STATE_RELAY:
            if (p_packet->payload.data.segment == 0)
            {
                m_transaction.segment_count = segment_count_from_start_packet(p_packet);
            }
            send_progress_event(p_packet->payload.data.segment, m_transaction.segment_count);
            do_relay = true;
            status = NRF_SUCCESS;
            break;
        default:
            status = NRF_ERROR_INVALID_STATE;
            break;
    }
    if (status == NRF_SUCCESS)
    {
        packet_cache_put(p_packet);
    }

    if (do_relay)
    {
        relay_packet(p_packet, length);
    }

    return status;
}

static uint32_t handle_state_packet(dfu_packet_t* p_packet)
{
    uint32_t status;

    switch (m_state)
    {
        case DFU_STATE_FIND_FWID:
            if (p_packet->payload.state.authority > 0)
            {
                status = notify_state_packet(p_packet);
            }
            else
            {
                //TODO
                //handle relaying of requests
                status = NRF_ERROR_NOT_SUPPORTED;
            }
            break;
        case DFU_STATE_DFU_REQ:
        case DFU_STATE_READY:
            if (ready_packet_matches_our_req(p_packet, m_transaction.type, &m_transaction.target_fwid_union))
            {
                if (p_packet->payload.state.authority > m_transaction.authority ||
                        (
                         p_packet->payload.state.authority == m_transaction.authority &&
                         p_packet->payload.state.transaction_id > m_transaction.transaction_id
                        )
                   )
                {
                    __LOG("\t->Upgradeable\n");
                    /* assume that the other device knows what to upgrade */
                    m_transaction.type = (dfu_type_t) p_packet->payload.state.dfu_type;
                    m_transaction.target_fwid_union = p_packet->payload.state.fwid;

                    start_ready(p_packet);
                    status = NRF_SUCCESS;
                }
                else
                {
                    /* Source is worse than the current, ignore */
                    status = NRF_SUCCESS;
                }
            }
            /* Notify about other transfer if the transfer is different from the current */
            else if (m_transaction.type != p_packet->payload.state.dfu_type ||
                    !fwid_union_id_cmp(
                        &p_packet->payload.state.fwid,
                        &m_transaction.target_fwid_union,
                        m_transaction.type))
            {
                status = notify_state_packet(p_packet);
            }
            else
            {
                status = NRF_SUCCESS;
            }
            break;
        case DFU_STATE_RELAY_CANDIDATE:
            if (m_transaction.type == p_packet->payload.state.dfu_type &&
                    fwid_union_cmp(&m_transaction.target_fwid_union, &p_packet->payload.state.fwid, m_transaction.type))
            {
                if (m_transaction.authority < p_packet->payload.state.authority ||
                        (m_transaction.authority      == p_packet->payload.state.authority &&
                         m_transaction.transaction_id <  p_packet->payload.state.transaction_id))
                {
                    __LOG("\tHigher authority (%u)\n", p_packet->payload.state.authority);
                    m_transaction.transaction_id = p_packet->payload.state.transaction_id;
                    m_transaction.authority      = p_packet->payload.state.authority;
                    beacon_set(state_beacon_type(m_transaction.type));
                }
            }
            status = NRF_SUCCESS;
            break;
        default:
            status = NRF_ERROR_INVALID_STATE;
    }

